# Getting Started with pandas

In [2]:
import pandas as pd
from pandas import Series, DataFrame

## Series

In [5]:
obj = pd.Series([4,5,-5,3]) #Contains a sequence of values and data labels
obj

0    4
1    5
2   -5
3    3
dtype: int64

In [8]:
obj.values #Values in the Series

array([ 4,  5, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) #Create series and specifc data labels
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2["a"] #Access values by data labels

-5

In [18]:
obj2[obj2>0] #Preserved index-value link

d    4
b    7
c    3
dtype: int64

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata) #Convert from dictionary to Series
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states) #Can pass in keys to produce certain order
obj4 #Californian produces NaN as there is no value for it in sdata

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4) #Outputs which data is null

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3+obj4 #Automatically aligns arithmetic with key labels

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [74]:
obj4.name = "Polulation" #Change attributes
obj4.index.name = "State" #Sets the index name to "States"
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Polulation, dtype: float64

## DataFrame

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data) #Create DataFrame from dictionary
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
frame.head() #Outputs the first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [53]:
#Arrange DataFrame in certain order with index
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],index = ['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [54]:
frame2['state'] #Retrieve column as a series by dict-notation

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [55]:
frame2.year #Retrieve column by attribute notation

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
frame2.loc['three'] #Retirve row by name

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [59]:
frame2.debt = 16.5 #Set the debt of all rows to 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [61]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) #Set specific index values
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [68]:
frame2["eastern"] = frame2.state == "Ohio" #Create a new column
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [69]:
del frame2["eastern"] #Delete the column
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [71]:
#When passing a nested dictionary, the outer keys are column headings and inner keys are row indexes
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [73]:
frame3.T #Transpose to "rotate" the frame

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [76]:
frame3.values #Outputs the data in the DataFrame

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## Index Objects